#ifndef __SIRIUS_REG_H__
#define __SIRIUS_REG_H__

typedef struct {
	unsigned int AUDIO_PLAY_I2S_DACINFO;       //0x00
	unsigned int AUDIO_PLAY_I2S_INDATA;
	unsigned int AUDIO_PLAY_I2S_OUTDATA;
	unsigned int AUDIO_PLAY_I2S_CHANNELsel;
	unsigned int AUDIO_PLAY_I2S_CPUSetPCM;     //0x10
	unsigned int AUDIO_PLAY_I2S_FIFOCTRL;
	unsigned int AUDIO_PLAY_I2S_DATAINV;
	unsigned int AUDIO_PLAY_I2S_INTEN;
	unsigned int AUDIO_PLAY_I2S_INT;           //0x20
	unsigned int AUDIO_PLAY_I2S_TIME_GATE;
	unsigned int AUDIO_PLAY_I2S_playingINDATA;
} AoutI2SRegs;

typedef struct {
	unsigned int AUDIO_PLAY_I2S_BUFFER_START_ADDR;        //0x00
	unsigned int AUDIO_PLAY_I2S_BUFFER_SIZE;
	unsigned int AUDIO_PLAY_I2S_BUFFER_SDC_ADDR;
	unsigned int AUDIO_PLAY_I2S_newFRAME_START_ADDR;
	unsigned int AUDIO_PLAY_I2S_newFRAME_END_ADDR;        //0x10
	unsigned int AUDIO_PLAY_I2S_playingFRAME_START_ADDR;
	unsigned int AUDIO_PLAY_I2S_playingFRAME_END_ADDR;
	unsigned int AUDIO_PLAY_I2S_newFrame_pcmLEN;
	unsigned int AUDIO_PLAY_I2S_playingFrame_pcmLEN;      //0x20
	unsigned int AUDIO_PLAY_I2S_RES0[3];
	unsigned int AUDIO_PLAY_I2S_SET_NEWFRAME_CONTROL;     //0x30
} AoutSdcRegs;

typedef struct {
	unsigned int AUDIO_SPDIF_CTRL;                     //0x00
	unsigned int AUDIO_SPDIF_INPUTDATA_INFO;
	unsigned int AUDIO_SPDIF_INT_EN;
	unsigned int AUDIO_SPDIF_INT;
	unsigned int AUDIO_SPDIF_PA_PB;                    //0x10
	unsigned int AUDIO_SPDIF_PC_PD;
	unsigned int AUDIO_SPDIF_CL1;
	unsigned int AUDIO_SPDIF_CL2;
	unsigned int AUDIO_SPDIF_CR1;                      //0x20
	unsigned int AUDIO_SPDIF_CR2;
	unsigned int AUDIO_SPDIF_U;
	unsigned int AUDIO_SPDIF_LAT_PAUSE;
	unsigned int AUDIO_SPDIF_DAT_PAU_LEN;              //0x30
	unsigned int AUDIO_SPDIF_newFRAME_LEN;
	unsigned int AUDIO_SPDIF_newFRAME_START_ADDR;
	unsigned int AUDIO_SPDIF_newFRAME_END_ADDR;
	unsigned int AUDIO_SPDIF_BUFFER_START_ADDR;        //0x40
	unsigned int AUDIO_SPDIF_BUFFER_SIZE;
	unsigned int AUDIO_SPDIF_PAUSE_PC_PD;
	unsigned int AUDIO_SPDIF_playingFRAME_LEN;
	unsigned int AUDIO_SPDIF_playingFRAME_START_ADDR;  //0x50
	unsigned int AUDIO_SPDIF_playingFRAME_END_ADDR;
	unsigned int AUDIO_SPDIF_BUFFER_READ_ADDR;
	unsigned int AUDIO_SPDIF_playingPCMFRAME_INFO;
	unsigned int AUDIO_SPDIF_PCM_TIME_GATE;           //0x60
	unsigned int AUDIO_SPDIF_RUBISH_DATA_SADDR;
	unsigned int AUDIO_SPDIF_RUBISH_DATA_LENGTH;
	unsigned int AUDIO_SPDIF_newFrame_pcmLEN;
	unsigned int AUDIO_SPDIF_playingFrame_pcmLEN;     //0x70
} AoutSpdRegs_0;

typedef struct {
	unsigned int AUDIO_SPDIF_CTRL;                     //0x00
	unsigned int AUDIO_SPDIF_INPUTDATA_INFO;
	unsigned int AUDIO_SPDIF_INT_EN;
	unsigned int AUDIO_SPDIF_INT;
	unsigned int AUDIO_SPDIF_PA_PB;                    //0x10
	unsigned int AUDIO_SPDIF_PC_PD;
	unsigned int AUDIO_SPDIF_CL1;
	unsigned int AUDIO_SPDIF_CL2;
	unsigned int AUDIO_SPDIF_CR1;                      //0x20
	unsigned int AUDIO_SPDIF_CR2;
	unsigned int AUDIO_SPDIF_U;
	unsigned int AUDIO_SPDIF_LAT_PAUSE;
	unsigned int AUDIO_SPDIF_DAT_PAU_LEN;              //0x30
	unsigned int AUDIO_SPDIF_newFRAME_LEN;
	unsigned int AUDIO_SPDIF_newFRAME_START_ADDR;
	unsigned int AUDIO_SPDIF_newFRAME_END_ADDR;
	unsigned int AUDIO_SPDIF_BUFFER_START_ADDR;        //0x40
	unsigned int AUDIO_SPDIF_BUFFER_SIZE;
	unsigned int AUDIO_SPDIF_PAUSE_PC_PD;
	unsigned int AUDIO_SPDIF_playingFRAME_LEN;
	unsigned int AUDIO_SPDIF_playingFRAME_START_ADDR;  //0x50
	unsigned int AUDIO_SPDIF_playingFRAME_END_ADDR;
	unsigned int AUDIO_SPDIF_BUFFER_READ_ADDR;
	unsigned int AUDIO_SPDIF_RUBISH_DATA_SADDR;
	unsigned int AUDIO_SPDIF_RUBISH_DATA_LENGTH;      //0x60
	unsigned int AUDIO_SPDIF_CL3;
	unsigned int AUDIO_SPDIF_CL4;
	unsigned int AUDIO_SPDIF_CL5;
	unsigned int AUDIO_SPDIF_CL6;                     //0x70
	unsigned int AUDIO_SPDIF_CR3;
	unsigned int AUDIO_SPDIF_CR4;
	unsigned int AUDIO_SPDIF_CR5;
	unsigned int AUDIO_SPDIF_CR6;                     //0x80
	unsigned int AUDIO_SPDIF_COUNT_STUFF;
	unsigned int AUDIO_SPDIF_NDS_CONFIG;
	unsigned int AUDIO_SPDIF_PCM_DMA_VOL_CTRL;
	unsigned int AUDIO_SPDIF_FRAME_MUTE_CTRL;
} AoutSpdRegs_1;

static unsigned int mask[33] = {
	0x00000000,
	0x00000001, 0x00000003, 0x00000007, 0x0000000f,
	0x0000001f, 0x0000003f, 0x0000007f, 0x000000ff,
	0x000001ff, 0x000003ff, 0x000007ff, 0x00000fff,
	0x00001fff, 0x00003fff, 0x00007fff, 0x0000ffff,
	0x0001ffff, 0x0003ffff, 0x0007ffff, 0x000fffff,
	0x001fffff, 0x003fffff, 0x007fffff, 0x00ffffff,
	0x01ffffff, 0x03ffffff, 0x07ffffff, 0x0fffffff,
	0x1fffffff, 0x3fffffff, 0x7fffffff, 0xffffffff
};

#define AOUT_REG_SET_VAL(reg, value) do {                                \
	(*(volatile unsigned int *)reg) = value;                             \
} while(0)

#define AOUT_REG_GET_VAL(reg)                                            \
	(*(volatile unsigned int *)reg)

