#ifndef __SIRIUS_VPU_REG_H__
#define __SIRIUS_VPU_REG_H__

#include "gxav_bitops.h"
#define VPU_MPW  (0)
#define VPU_NRE  (1)

//#define VPU_REG_BASE_ADDR         (0x89500000)
//#define VPU_REG_BASE_ADDR         (0x8A800000)

#define OSD_ADDR_MASK             (0xFFFFFFFF)
#define OSD_BASE_LINE_MASK        (0x0001FFF)
#define SPP_ADDR_MASK             (0xFFFFFFFF)
#define VPP_ADDR_MASK             (0xFFFFFFFF)
#define VBI_ADDR_MASK             (0xFFFFFFF)
#define CE_ADDR_MASK              (0xFFFFFFFF)

struct osd_reg {
	unsigned int rOSD_CTRL;//0x0090
	unsigned int rOSD_FIRST_HEAD_PTR;
	unsigned int rOSD_VIEW_SIZE;
	unsigned int rOSD_ZOOM;
	unsigned int rOSD_COLOR_KEY;//0x00A0
	unsigned int rOSD_ALPHA_5551;
	unsigned int rOSD_PHASE_SIGN;
	unsigned int rOSD_POSITION;
	unsigned int rOSD_PARA;//0x00B0
	unsigned int rOSD_PHASE_0_H;
	unsigned int rOSD_PHASE_0_V;
	unsigned int rOSD_PHASE_BIAS;
};

typedef struct _enhance_reg {
	unsigned int rGAMMA_COEF00; //0x4110
	unsigned int rGAMMA_COEF01;
	unsigned int rGAMMA_COEF02;
	unsigned int rGAMMA_COEF03;
	unsigned int rGAMMA_COEF04;

	unsigned int rGAMMA_RESERVED0[3];

	unsigned int rGAMMA_COEF10; //0x4130
	unsigned int rGAMMA_COEF11;
	unsigned int rGAMMA_COEF12;
	unsigned int rGAMMA_COEF13;
	unsigned int rGAMMA_COEF14;

	unsigned int rGAMMA_RESERVED1[3];

	unsigned int rGAMMA_COEF20; //0x4150
	unsigned int rGAMMA_COEF21;
	unsigned int rGAMMA_COEF22;
	unsigned int rGAMMA_COEF23;
	unsigned int rGAMMA_COEF24; //0x4160

	unsigned int rG_ENHANCEMENT_CTL; //0x4164
	unsigned int rB_STRETCH_CTL;
	unsigned int rENH_SRC_SEL;
	unsigned int rPRM_LTI_CFG_0; //0x4170
	unsigned int rPRM_LTI_CFG_1;
	unsigned int rPRM_PEAKING_CFG_0;
	unsigned int rPRM_PEAKING_CFG_1;
	unsigned int rPRM_CTI_CFG_0; //0x4180
	unsigned int rPRM_CTI_CFG_1;
	unsigned int rPRM_BLEC_BRT_CFG;
	unsigned int rPRM_HUE_STA_CON_CFG;
	unsigned int rPRM_HEC_CFG_0; //0x4190
	unsigned int rPRM_HEC_CFG_1;
	unsigned int rPRM_HEC_CFG_2;
	unsigned int rPRM_HEC_CFG_3;
	unsigned int rPRM_HEC_CFG_4; //0x41A0
	unsigned int rSCN_BLEC_BRT_HUE_CFG;
	unsigned int rSCN_STA_CON_CFG;
	unsigned int rMIX_Y_FIR_PARA0;
	unsigned int rMIX_Y_FIR_PARA1; //0x41B0
	unsigned int rMIX_C_FIR_PARA0;
	unsigned int rMIX_C_FIR_PARA1;
}enhance_reg;

typedef struct sirius_vpu_reg {
	unsigned int rPP_CTRL;//0x0000
	unsigned int rPP_V_PHASE;
	unsigned int rPP_POSITION;
	unsigned int rPP_SOURCE_SIZE;
	unsigned int rPP_VIEW_SIZE;//0x0010
	unsigned int rPP_ZOOM;
	unsigned int rPP_FRAME_STRIDE;
	unsigned int rPP_FILTER_SIGN;
	unsigned int rPP_PHASE_0_H;//0x0020
	unsigned int rPP_PHASE_0_V;
	unsigned int rPP_DISP_CTRL;
	unsigned int rPP_DISP_R_PTR;
	unsigned int rPP_BACK_COLOR;//0x0030
	unsigned int rRESERVED_0[3];//0x0034~0x003C

	unsigned int rPIC_CTRL;//0x0040
	unsigned int rPIC_V_PHASE;
	unsigned int rPIC_POSITION;
	unsigned int rPIC_SOURCE_SIZE;
	unsigned int rPIC_VIEW_SIZE;//0x0050
	unsigned int rPIC_ZOOM;
	unsigned int rPIC_PARA;
	unsigned int rPIC_FILTER_SIGN;
	unsigned int rPIC_PHASE_0_H;//0x0060
	unsigned int rPIC_PHASE_0_V;
	unsigned int rPIC_Y_TOP_ADDR;
	unsigned int rPIC_Y_BOTTOM_ADDR;
	unsigned int rPIC_UV_TOP_ADDR;//0x0070
	unsigned int rPIC_UV_BOTTOM_ADDR;
	unsigned int rPIC_BACK_COLOR;
	unsigned int rRESERVED_1[5];//0x007C~0x008C

	struct osd_reg osd_0; //0x0090~0x00BC

	unsigned int rCAP_CTRL;//0x00C0
	unsigned int rCAP_ADDR;
	unsigned int rCAP_HEIGHT;
	unsigned int rCAP_WIDTH;
	unsigned int rCAP_BUF_CTRL;//0xD0
	unsigned int rRESERVED_2[2];//0x00D4~0x00D8

	unsigned int rMIX_CTRL2;
	unsigned int rCHIPTEST;//0x00E0
	unsigned int rSCAN_LINE;
	unsigned int rSYS_PARA;
	unsigned int rRESERVED_3[1];//0x00EC
	unsigned int rLAYER_CTRL;
	unsigned int rEMPTY_GATE_1;
	unsigned int rEMPTY_GATE_2;
	unsigned int rFULL_GATE;
	unsigned int rBUFFER_INT;//0x0100
	unsigned int rPP_JPG_MIX_CTRL;
	unsigned int rCRC0;
	unsigned int rCRC1;
	unsigned int rOSD_EN_DLY;//0x0110
	unsigned int rRESERVED_4[3];//0x0114~0x011C

	unsigned int rVBI_CTRL;//0x0120
	unsigned int rVBI_FIRST_ADDR;
	unsigned int rVBI_ADDR;
	unsigned int rRESERVED_5[1];

	unsigned int rGIAN_DAC;//0x0130
	unsigned int rPOWER_DOWN;
	unsigned int rPOWER_DOWN_BYSELF;
	unsigned int rRESERVED_6[1];

	unsigned int rPP_FILTER_PARA[4]; //0x0140~0x014C
	unsigned int rJPG_FILTER_PARA[4];//0x0150~0x015C
	unsigned int rOSD_FILTER_PARA[4];//0x0160~0x016C
	unsigned int rSOSD_FILTER_PARA[4];//0x0170~0x017C
	unsigned int rSOSD2_FILTER_PARA[4];//0x0180~0x018C

	struct osd_reg osd_1; //0x0190~0x01BC
	struct osd_reg osd_2; //0x01C0~0x01EC

	unsigned int rRESERVED_7[3]; //0x01F0~0x01F8
	unsigned int rMODULE_EDITION;//0x01FC

	unsigned int rPP_PHASE_PARA_H[64];//0x0200~0x02FC
	unsigned int rPP_PHASE_PARA_V[64];//0x0300~0x03FC
	unsigned int rOSD_PHASE_PARA[64];//0x0400~0x04FC

	unsigned int rDISP_CTRL[8][8];//0x0500~0x05FC

	unsigned int rPIC_PHASE_PARA_H[64];//0x0600~0x06FC
	unsigned int rPIC_PHASE_PARA_V[64];//0x0700~0x07FC
	unsigned int rSOSD_PHASE_PARA[64]; //0x0800~0x08FC
	unsigned int rSOSD2_PHASE_PARA[64]; //0x0900~0x09FC

	// Reserve for Video Out
	unsigned int rRESERVED_VOUT[3524]; //0x0a00~0x410C
	enhance_reg enhance; // 0x4110
}SiriusVpuReg;

/*****************************************************************************/
/*                                   VPP                                     */
/*****************************************************************************/


//VPP_CTRL
#define bVPU_VPP_EN               (0)
#define bVPU_VPP_ZOOM_MODE        (1)
#define bVPU_VPP_V_DOWNSCALE_EN   (2)
#define bVPU_VPP_H_DOWNSCALE_EN      (3)
#define bVPU_VPP_FIELD_START      (4)
#define bVPU_VPP_MODE_UV          (6)

#define bVPU_VPP_H_PHASE_BIAS     (8)
#define bVPU_VPP_VT_PHASE_BIAS    (0)
#define bVPU_VPP_VB_PHASE_BIAS    (16)
#define bVPU_VPP_BLUR_EN          (30)

#define mVPU_VPP_EN               (0x01<<bVPU_VPP_EN )
#define mVPU_VPP_ZOOM_MODE        (0x01<<bVPU_VPP_ZOOM_MODE)
#define mVPU_VPP_MODE_UV          (0x03<<bVPU_VPP_MODE_UV)
#define mVPU_VPP_H_PHASE_BIAS     (0x7F<<bVPU_VPP_H_PHASE_BIAS)
#define mVPU_VPP_VT_PHASE_BIAS    (0x7FFF<<bVPU_VPP_VT_PHASE_BIAS)
