#ifndef __GX32XX_AREG_H__
#define __GX32XX_AREG_H__

struct audiodec_regs
{
	unsigned int audio_mcu_rev0[64]                 ;
	unsigned int audio_mcu_buf_ctrl_addr            ;/* 0x100 */
	unsigned int audio_mcu_eear                     ;/* 0x104 */
	unsigned int audio_mcu_epcr                     ;
	unsigned int audio_mcu_expc                     ;
	unsigned int audio_mcu_apts                     ;
	unsigned int audio_mcu_inten                    ;
	unsigned int audio_mcu_int                      ;
	unsigned int audio_mcu_baseaddr                 ;
	unsigned int audio_mcu_decode_ctrl              ;
	unsigned int audio_mcu_rev1[7]                  ;
	unsigned int audio_mcu_esa1_buffer_start_addr   ;/* 0x140 */
	unsigned int audio_mcu_esa1_buffer_size         ;
	unsigned int audio_mcu_esa2_buffer_start_addr   ;
	unsigned int audio_mcu_esa2_buffer_size         ;
	unsigned int audio_mcu_pcm_buffer_start_addr    ;
	unsigned int audio_mcu_pcm_buffer_size          ;
	unsigned int audio_mcu_esa1_frame_saddr         ;
	unsigned int audio_mcu_esa1_w_addr              ;
	unsigned int audio_mcu_esa2_frame_saddr         ;
	unsigned int audio_mcu_esa2_w_addr              ;
	unsigned int audio_mcu_pcm_w_saddr              ;
	unsigned int audio_mcu_com_source_buffer_saddr  ;
	unsigned int audio_mcu_com_source_buffer_size   ;
	unsigned int audio_mcu_com_target_buffer_saddr  ;
	unsigned int audio_mcu_com_target_buffer_size   ;
	unsigned int audio_mcu_com_source_saddr         ;
	unsigned int audio_mcu_com_source_eaddr         ;
	unsigned int audio_mcu_com_target_saddr         ;
	union {
		struct {
			unsigned int audio_mcu_point_to_sdram1  ;/* 0x188 */
			unsigned int audio_mcu_point_to_sdram3  ;
		};
		struct {
			unsigned int audio_mcu_stream_pid       ;/* 0x188 */
			unsigned int audio_mcu_stream_type      ;
		};
	};
	unsigned int audio_mcu_audio_standard           ;/* 0x190 */
	unsigned int audio_mcu_sample_frequency         ;
	unsigned int audio_mcu_sample_bitrate           ;
	unsigned int audio_mcu_esa1_r_addr              ;
	unsigned int audio_mcu_esa2_r_addr              ;
	unsigned int audio_mcu_pcm_w_addr               ;
	unsigned int audio_mcu_decode_info              ;
	unsigned int audio_mcu_parse_info               ;
	unsigned int audio_mcu_savedesa1_w_addr         ;
	unsigned int audio_mcu_savedesa2_w_addr         ;
	unsigned int audio_mcu_channel_num              ;
	unsigned int audio_mcu_audioframe1_saddr        ;
	unsigned int audio_mcu_audioframe2_saddr        ;
	unsigned int audio_mcu_com_target_eaddr         ;
	union {
		struct {
			unsigned int audio_mcu_task_queue       ;
			unsigned int audio_mcu_point_to_sdram2  ;/* 0x1cc */
			unsigned int audio_mcu_point_to_sdram4  ;/* 0x1d0 */
			unsigned int audio_mcu_rev3[1]          ;
			unsigned int audio_mcu_aptsaddr         ;
		};
		struct {
			unsigned int audio_mcu_low_apts         ;
			unsigned int audio_mcu_rev3_1[3]        ;
			unsigned int audio_mcu_high_apts        ;
		};
	};
	unsigned int audio_mcu_com_source_r_addr        ;
	unsigned int audio_mcu_rev4[2]                  ;/* 0x1e0 */
	unsigned int audio_mcu_point_to_size1           ;
	unsigned int audio_mcu_axi_8to32_ctrl           ;
	unsigned int audio_mcu_pcmbuf_protect_saddr     ;/* 0x1f0*/
	unsigned int audio_mcu_pcmbuf_protect_size      ;
	unsigned int audio_mcu_protect_work_size        ;
	unsigned int audio_mcu_decode_ctrl2             ;
};
/*-------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------*/

/* Private Macros -------------------------------------------------------- */
#define SET_BIT(reg,bit)                         \
	do                                           \
{                                                \
	gx_set_bit((bit), &(reg));                   \
}while(0)

#define CLR_BIT(reg,bit)                         \
	do                                           \
{                                                \
	gx_clear_bit((bit), &(reg));                 \
}while(0)

#define GET_BIT(reg,bit)                         \
	gx_test_bit((bit), &(reg))

