#ifndef __GX3211_VIDEO_OUT_REG_H__
#define __GX3211_VIDEO_OUT_REG_H__

#include "gxav_bitops.h"

struct gx3211_videoout_reg
{
	unsigned int   tv_ctrl        ;//00
	unsigned int   tv_dac         ;
	unsigned int   tv_hsync       ;
	unsigned int   tv_active      ;
	unsigned int   tv_fir_y0_2    ;//10
	unsigned int   tv_fir_y3_5    ;
	unsigned int   tv_fir_y6_8    ;
	unsigned int   tv_fir_y9      ;
	unsigned int   tv_fir_c0_2    ;//20
	unsigned int   tv_fir_c3_5    ;
	unsigned int   colr_tran      ;
	unsigned int   line_pixel_num ;
	unsigned int   tv_range       ;//30
	unsigned int   tv_adjust      ;
	unsigned int   tv_test        ;
	unsigned int   color_tran_c   ;
	unsigned int   pposd_delay    ;//40
	unsigned int   sog_enable     ;
	unsigned int   vsync_width    ;
	unsigned int   vbi_cc_ctrl    ;
	unsigned int   vbi_cc_data    ;//50
	unsigned int   vbi_wss_ctrl   ;
	unsigned int   vbi_vps_ctrl   ;
	unsigned int   vbi_cgms_ctrl  ;
	unsigned int   vbi_wss_data   ;//60
	unsigned int   vbi_cgms_data  ;
	unsigned int   vbi_tlx_ctrl1  ;
	unsigned int   vbi_tlx_ctrl2  ;
	unsigned int   scart_ctrl     ;//70
	unsigned int   dgdp_enable    ;
	unsigned int   dgdp_ctrl_reg1 ;
	unsigned int   dgdp_ctrl_reg2 ;
	unsigned int   dgdp_ctrl_reg3 ;//80
	unsigned int   dgdp_ctrl_reg4 ;
	unsigned int   tri_sync_ctrl  ;
	unsigned int   lcd_vsync_width;
	unsigned int   digital_ctrl   ;//90
	unsigned int   bt656_ctrl0    ;
	unsigned int   bt656_ctrl1    ;
	unsigned int   bt656_ctrl2    ;
	unsigned int   lcd_line_ctrl  ;//a0
	unsigned int   dgdp0_enable   ;
	unsigned int   dgdp0_ctrl_reg1;
	unsigned int   dgdp0_ctrl_reg2;
	unsigned int   dgdp0_ctrl_reg3;//b0
	unsigned int   dgdp0_ctrl_reg4;
	unsigned int   bt656_tran_para;
	unsigned int   aps_ctrl0      ;
	unsigned int   aps_ctrl1      ;//c0
	unsigned int   aps_ctrl2      ;
	unsigned int   aps_ctrl3      ;
	unsigned int   aps_reg0       ;
	unsigned int   aps_reg1       ;//d0
	unsigned int   aps_reg2       ;
	unsigned int   aps_reg3       ;
	unsigned int   aps_reg4       ;
	unsigned int   dcs_ctrl4      ;//e0
	unsigned int   dcs_cpreg_in_L ;
	unsigned int   dcs_cpreg_in_H ;
	unsigned int   vbi_cgms_ctrl2 ;
	unsigned int   vbi_cgms_b_data0;//f0
	unsigned int   vbi_cgms_b_data1;
	unsigned int   vbi_cgms_b_data2;
	unsigned int   vbi_cgms_b_data3;
	unsigned int   vbi_cgms_b_data4;//100
	unsigned int   resv0[3];
	unsigned int   gamma0_ctl0;//110
	unsigned int   gamma0_ctl1;
	unsigned int   gamma0_ctl2;
	unsigned int   gamma0_ctl3;
	unsigned int   gamma0_ctl4;//120
	unsigned int   resv1[3];
	unsigned int   gamma1_ctl0;//130
	unsigned int   gamma1_ctl1;
	unsigned int   gamma1_ctl2;
	unsigned int   gamma1_ctl3;
	unsigned int   gamma1_ctl4;//140
	unsigned int   resv2[3];
	unsigned int   gamma2_ctl0;//150
	unsigned int   gamma2_ctl1;
	unsigned int   gamma2_ctl2;
	unsigned int   gamma2_ctl3;
	unsigned int   gamma2_ctl4;//160
	unsigned int   resv3[3];
	unsigned int   lvds_ctrl;//170
	unsigned int   cb_hue_ctl;
	unsigned int   cr_hue_ctl;
	unsigned int   resv4[12];
	unsigned int   mix_y_fir_para0;//1ac
	unsigned int   mix_y_fir_para1;//1b0
	unsigned int   mix_c_fir_para0;
	unsigned int   mix_c_fir_para1;
};

/* Private Macros -------------------------------------------------------- */
/* Definition of register (vbi_wss_data)scart_ctrl's bit, mask, value */
#define bBT656_V_POS              (24)
#define bBT656_H_POS              (16)

/* Definition of register rTV_CTRL's bit, mask, value */
#define bDAC_FULLCASE_CHANGE            (25)
#define bTV_CTRL_DAC_OUT_MODE           (17)
#define bTV_CTRL_FRAME_FRE              (5)
#define bTV_CLOSE_EN                    (4)
#define bTV_CTRL_TV_FORMAT              (0)

#define mDAC_FULLCASE_CHANGE            (0x1f   << bDAC_FULLCASE_CHANGE     )
#define mTV_CTRL_DAC_OUT_MODE           (0x07   << bTV_CTRL_DAC_OUT_MODE    )
